{
  "speakers": [
    {"id": "oleg_bartunov",
      "name": "Олег Бартунов",
      "photoUrl": "https://images.ctfassets.net/oxjq45e8ilak/4ahiiEVd1YeU2KMmU0Gggy/22fa2c2e4c04fb6973e2d722ebb06c0d/Bartunov__1_.jpg?w=200",
      "job": "Postgres Professional",
      "info": "Сооснователь и генеральный директор компании Postgres Professional, разработчика российской СУБД Postgres Pro. Один из трех ведущих российских разработчиков (major contributor) СУБД PostgreSQL с более чем 20-летним стажем. Профессиональный астроном, создатель портала Astronet.ru. После окончания физфака МГУ работал в Государственном астрономическом институте им. П. К. Штернберга МГУ (ГАИШ). Занимался исследованиями сверхновых звезд и использованием информационных технологий, в частности, баз данных, в астрономии. Начал использовать PostgreSQL в 1995 году при решении астрономических задач. Первым его вкладом в проект стала работа по локализации PostgreSQL в 1997 году, которая сделала Постгрес более доступным для неанглоязычных пользователей.",
      "links": {
        "twitter": "",
        "telegram": "",
        "site": "",
        "email": ""
      }
    },
    {"id": "vasiliy_ershov",
      "name": "Василий Ершов",
      "photoUrl": "https://images.ctfassets.net/oxjq45e8ilak/3Xuziy8iYM6wsOCeEOE6UI/5678e1c1f0f7fa0e8e729776ba582137/Ershov.jpg?w=200",
      "job": "Яндекс Разработчик CatBoost ",
      "info": "Закончил Санкт-Петербургский государственный университет и Computer Science Center (Санкт-Петербургское отделение ШАД). Аспирант Санкт-Петербургского государственного университета. C 2014 года работает в Яндексе, занимается развитием алгоритмов машинного обучения и ускорением их на GPU.",
      "links": {
        "twitter": "",
        "telegram": "",
        "site": "",
        "email": ""
      }
    },
    {"id": "oleg_anastasiev",
      "name": "Олег Анастасьев",
      "photoUrl": "https://images.ctfassets.net/oxjq45e8ilak/4C7bfU4gpO4qcGI8CiGucC/8159987353f454477df507b61a4c3ef9/______________________________2.jpg?w=200",
      "job": "Одноклассники",
      "info": "Начал карьеру программиста в далеком 1995 году. Разрабатывал ПО в банковской сфере, телекоме, транспорте. Работает ведущим разработчиком в Одноклассниках с 2007 года в команде платформы. В его обязанности входит разработка архитектур и решений для высоконагруженных систем, больших хранилищ данных, решение проблем производительности и надежности портала. Также занимается обучением разработчиков внутри компании.",
      "links": {
        "twitter": "",
        "telegram": "",
        "site": "",
        "email": ""
      }
    },
    {"id": "goblin",
      "name": "Дмитрий Пучков",
      "photoUrl": "https://images.ctfassets.net/oxjq45e8ilak/34ip2Gi2J20Wmm40QSI6Cm/483edfd2dc663ef920affaa0d63918dc/Puchkov.jpg?w=200",
      "job": "Oper.ru",
      "info": "Российский переводчик, писатель, публицист и локализатор, известный под творческим псевдонимом «старший оперуполномоченный Goblin». Основатель и ведущий таких проектов, как oper.ru, Синий Фил, Опергеймер, Разведопрос и многих других. Автор нескольких книг и целого вороха переводов голливудских фильмов. Сценарист и один из разработчиков игры «Санитары подземелий».",
      "links": {
        "twitter": "https://twitter.com/goblin_oper",
        "telegram": "",
        "site": "",
        "email": ""
      }
    },
    {"id": "ilya_klimov",
      "name": "Илья Климов",
      "photoUrl": "https://images.ctfassets.net/oxjq45e8ilak/y3aOzs3rgGwsOaauM2cme/4881ec403b434a9e7094c4bd13986b3b/29511551_1420499948078476_8867400294049251328_o.jpg?w=200",
      "job": "WookieeLabs",
      "info": "13 лет программирует на JS во всех его проявлениях: от микроконтроллеров до облачного рендеринга видео. Более 5 лет профессионально учит людей (в двух вузах и на собственных курсах), кандидат технических наук. Организовывает конференцию KhJS в Харькове, тренер проекта Kottans.Org. Владелец небольшой аутсорсинговой компании WookieeLabs, специализирующейся исключительно на JS-проектах.",
      "links": {
        "twitter": "https://twitter.com/xanf_ua",
        "telegram": "",
        "site": "",
        "email": ""
      }
    },
    {"id": "artem_kalichkin",
      "name": "Артем Каличкин",
      "photoUrl": "https://images.ctfassets.net/oxjq45e8ilak/12BF0hSP1AsiSSuWUuaySY/10b70dda059811cf5c22f60c2dc8a192/Kalichkin.jpg?w=200",
      "job": "ЦФТ",
      "info": "Обеспечивает отказоустойчивость и непрерывность предоставления процессинговых сервисов компании. Успешно запустил ITIL, потом немного пододвинул его и, вовлекая инженеров всех уровней, зажёг луч DevOps, о чём можно узнать из докладов Артёма с конференции RootConf 2015 и 2016 гг.\n\nАктивно занимается работой с молодыми специалистами, как Dev, так и Ops. Рассказывает о и старается научить принципам промышленной разработки и эксплуатации ПО. Ведёт профильные спецкурсы в Новосибирском Государственном Университете.",
      "links": {
        "twitter": "",
        "telegram": "",
        "site": "Faktura.ru",
        "email": ""
      }
    },
    {"id": "romuald_zdebsky",
      "name": "Ромуальд Здебский",
      "photoUrl": "https://images.ctfassets.net/oxjq45e8ilak/5eHtn5dESQqMiS8QCAy0eQ/2e605c9a5f6156452e57f72f0deb589c/zdebsky.jpg?w=200",
      "job": "Microsoft",
      "info": "Ромуальд отвечает за работу по совместным проектам и разработкам с ведущими партнерами и клиентами Microsoft в регионе Восточной Европы. До этого в Microsoft координировал работу технических экспертов по разработке программного обеспечения и управлению информационной инфраструктурой с точки зрения ключевых технологических приоритетов платформы Microsoft.\n\nНеоднократно выступал и принимал ключевое участие в подготовке ряда технических конференций компании (Платформа, Дни разработчика, TechDays, запуск Visual Studio 2008/2010, ReMIX, DevCon и другие). Руководил подготовкой конференции Платформа 2011 и первой международной конференции TechEd Russia 2011.\n\nВ последние годы отвечал за работу с рядом ключевых партнеров Microsoft по разработке в регионе и занимался выпуском популярных игр и приложений.",
      "links": {
        "twitter": "https://twitter.com/zdebskiy",
        "telegram": "",
        "site": "",
        "email": ""
      }
    },
    {"id": "maxim_zakharov",
      "name": "Максим Захаров",
      "photoUrl": "https://images.ctfassets.net/oxjq45e8ilak/3aHI2OIFb2Ao4CO8Qo8kOk/e28e3fc7107d665408a3d922c7594db7/Zaharov.jpg?w=200",
      "job": "Контур",
      "info": "С 2007 года — тестировщик в продуктовой разработке. В копилке опыта — тестирование систем автоматизации ЖКХ, бюджетирования, CRM, Service Desk.\n\nСейчас занимается тестированием EDI (электронный документооборот в ритейле) в компании «Контур».\n\nОдин из организаторов сообщества тестировщиков Екатеринбурга — UTC.\n\nАвтор единственного подпольного перевода книги Сэма Канера «Lessons Learned in Software Testing», организатор и соучастник переводов книг по тестированию Вайнберга и Копланда.",
      "links": {
        "twitter": "",
        "telegram": "",
        "site": "",
        "email": ""
      }
    },
    {"id": "irina_polunina",
      "name": "Максим Захаров",
      "photoUrl": "https://images.ctfassets.net/oxjq45e8ilak/urBTtWhc2smWEW8yeeuws/2790899923ae99481d7107d0c355ef67/Polunina.jpg?w=200",
      "job": "Контур",
      "info": "Занимается тестированием в проекте Контур.Бухгалтерии с 2016 года. Тестирование аналитики, ручное тестирование, написание автотестов.",
      "links": {
        "twitter": "",
        "telegram": "",
        "site": "",
        "email": ""
      }
    }
  ],
  "events": [
    {
      "id": "1",
      "title": "Путь Слона, или Карьера в open source",
      "about": "В ходе выступления Олег поделится тем, как ему удалось пройти путь от простого астронома до разработчика с мировым именем благодаря участию в open source-проекте PostgreSQL.\n\nРаботая в крупных корпорациях, программист становится винтиком в огромной махине. А создавая ПО с открытым кодом, человек остается личностью, и перспективы, которые открываются перед ним как профессионалом, иногда даже больше, чем в коммерческой компании. Положение и карьера разработчика в open source не зависят от руководства, здесь все прозрачно и зависит только от личного вклада. Работа в open source приносит чувство причастности к созданию продукта, которым будут пользоваться миллионы людей по всему миру.\n\nОлег расскажет о личном опыте становления в ИТ-сфере, от студенчества на физфаке МГУ в Москве, астрономических исследований в ГАИШ и Санта-Круз (США) до вовлечения в международное сообщество разработчиков СУБД PostgreSQL и основания собственной компании Postgres Professional.",
      "time": "2018-09-01T12:00:00",
      "room": "1",
      "speakers": ["oleg_bartunov"],
      "tags": [
        {
          "name": "PostgreSQL",
          "color": 0
        }, {
          "name": "database",
          "color": 0
        }, {
          "name": "opensource",
          "color": 0
        }
      ]
    },
    {
      "id": "2",
      "title": "CatBoost — библиотека машинного обучения для решения практических задач с использованием больших данных",
      "about": "Градиентный бустинг — один из наиболее часто используемых алгоритмов машинного обучения. Этот алгоритм помогает решать задачи регрессии, классификации и ранжирования на разнородных данных. При помощи градиентного бустинга в Яндексе мы выбираем наиболее релевантные документы для ответа на поисковые запросы, ранжируем музыкальные композиции, предсказываем погоду и решаем много других задач.\n\nCatBoost — это библиотека градиентного бустинга, написанная в Яндексе и выложенная в открытый доступ. В докладе мы расскажем, что такое градиентный бустинг, как он применяется, чем отличается CatBoost от других библиотек, как при помощи него обучать модели на больших данных и как работать с разными типами данных — числовыми и категориальными.",
      "time": "2018-09-01T12:00:00",
      "room": "2",
      "speakers": ["vasiliy_ershov"],
      "tags": [
        {
          "name": "ML",
          "color": 0
        }
      ]
    },
    {
      "id": "3",
      "title": "Надежность в распределенных системах",
      "about": "Одноклассники — это одна из самых больших, сложных и нагруженных распределенных систем в мире. Тысячи серверов участвуют в обработке запросов пользователей в реальном времени. Каждый из этих серверов владеет только частью данных или логики. Эти части в социальной сети изолировать друг от друга невозможно, поэтому между серверами происходит много сетевого взаимодействия, разнообразного и большого по объему.\n\nВ распределенной системе такого размера что-то постоянно тупит и отказывает. Как же построить систему так, чтобы, несмотря на постоянные сбои, все продолжало работать? Что делать с полными и частичными отказами?\n\nЧто такое идемпотентность и спекуляция? Что нужно предусмотреть на случай неработоспособности целой подсистемы или «главной» БД? Как организовать надежное препродакшн-тестирование и выкатку релизов?\n\nВопросов в таких системах всегда много. Приходите, и мы расскажем ответы Одноклассников на эти вопросы.",
      "time": "2019-09-01T13:00:00",
      "room": "1",
      "speakers": ["oleg_anastasiev"],
      "tags": [
        {
          "name": "distributed",
          "color": 0
        }
      ]
    },
    {
      "id": "4",
      "title": "Разведопрос: Иван Ямщиков",
      "about": "Дмитрий Goblin Пучков и его «Разведопрос» в формате live! Собеседником известного «оперуполномоченного» в этот раз станет один из спикеров TechTrain — Иван Ямщиков, гуру в области искусственного интеллекта. Обсуждать будем серьезные вещи: когда нейросети смогут (и смогут ли) творить, думать и стоит ли ждать бунта искусственного интеллекта против гуманистической тирании. Будет интересно, категорически полезно и захватывающе.",
      "time": "2018-09-01T13:00:00",
      "room": "2",
      "speakers": ["goblin"],
      "tags": [
        {
          "name": "Goblin",
          "color": 0
        }, {
          "name": "ML",
          "color": 0
        }, {
          "name": "openmind",
          "color": 0
        }, {
          "name": "Q&A",
          "color": 0
        }
      ]
    },
    {
      "id": "5",
      "title": "JavaScript для тех, кого там нет",
      "about": "Общение мира фронтенд-разработки и прочей IT-тусовки всегда было натянутым. В конце концов, как можно считать программистом того, кто не знает третьей нормальной формы, не понимает, что такое указатель, и не может отличить Приму от Краскала. Ок, хотя бы что-то одно, но бинго «3 из 3» встречается повсеместно.\n\nЛишь в последние годы взрывообразный рост JavaScript (уже не просто фронтенда) привел к фундаментальному росту сложности, и если вы все еще считаете, что основное, чем мы занимаемся, — это «ты ж верстальщик — наверстай нам упущенное», этот доклад станет легкой и увлекательной прогулкой в то, какова жизнь современного эксперта в области JS-разработки.",
      "time": "2018-09-02T12:00:00",
      "room": "1",
      "speakers": ["ilya_klimov"],
      "tags": [
        {
          "name": "frontend",
          "color": 0
        }
      ]
    },
    {
      "id": "6",
      "title": "Отказоустойчивость распределенных вычислений: поменьше проб и ошибок!",
      "about": "Все мы знаем про паттерны проектирования. И убеждены, что это базовое знание для любого программиста. Когда же речь заходит об отказоустойчивости под высокими нагрузками, мы часто ограничиваем себя кластеризацией, шардированием и вот этим всем. А потом начинается реальная жизнь нашего приложения, которая приносит немало сюрпризов. И начинается путь через тернии… к терниям.\n\nПосле череды ошибок у нас в проекте появляются «переборки», circuit breakers, heartbeat и leak bucket-тесты мониторинга. Но это все тоже известные и довольно фундаментальные паттерны взаимодействия. Они появились не сегодня, пришли к нам из области электроники, прошли закалку в космических проектах и аккуратно изложены на блюдечке во многих полезных как узкоспециальных, так и широко известных книгах.\n\nВ своем докладе Артем расскажет, как сам шел к этим знаниям и почему считает, что это часть фундаментальных принципов в нашей отрасли. Расскажет, как все это легко уложить в голове и что следует прочитать, чтобы не идти методом проб и ошибок к заветным 99,999.",
      "time": "2018-09-02T12:00:00",
      "room": "2",
      "speakers": ["artem_kalichkin"],
      "tags": [
        {
          "name": "architecture",
          "color": 0
        },
        {
          "name": "casestudy",
          "color": 0
        }
      ]
    },
    {
      "id": "7",
      "title": "Как сделать быстрое мобильное приложение один раз для всех платформ",
      "about": "В докладе на примере технологии Xamarin мы рассмотрим, как эволюционировали технологии кроссплатформенной мобильной разработки для создания быстрых приложений с нативными интерфейсами и полным доступом к возможностям смартфонов. Также мы познакомимся с тем, как можно тестировать и разрабатывать мобильные приложения с помощью облачных технологий.",
      "time": "2018-09-02T13:00:00",
      "room": "1",
      "speakers": ["romuald_zdebsky"],
      "tags": [
        {
          "name": "xamarin",
          "color": 0
        }
      ]
    },
    {
      "id": "8",
      "title": "Автотестеры не нужны, или Эволюция применения тестов",
      "about": "Максим и Ирина расскажут о том, как на протяжении десяти лет команды, в которых они работали, пробовали разные подходы, процессы и виды тестов. Как из предельно вредной активности автоматизация тестирования становилась относительно бесполезной, а затем приносящей небольшую пользу. Покажут эволюцию процесса в картинках, цифрах и примерах (на картинках можно будет узнать себя).\n\nПрозвучат такие фразы, как «Нам некогда писать тесты», «Время разработчиков слишком ценно, чтоб тратить его на поднятие тестов», «Юнит-тестами должны заниматься разработчики, а UI — тестировщики».\n\nЧасть доклада посвящена сложностям и неожиданным эффектам, которые возникли у одной команды при попытке эволюционировать, и решениям, которые они нашли или еще ищут.",
      "time": "2018-09-02T13:00:00",
      "room": "2",
      "speakers": ["maxim_zakharov", "irina_polunina"],
      "tags": [
        {
          "name": "UTC",
          "color": 0
        },
        {
          "name": "casestudy",
          "color": 0
        },
        {
          "name": "management",
          "color": 0
        },
        {
          "name": "engineer",
          "color": 0
        }
      ]
    }
  ],
  "conference": {
    "name": "TechTrain",
    "year": 2018,
    "site": "https://2018.techtrain.ru/",
    "imageUrl": "https://2018.techtrain.ru/assets/images/logo.svg",
    "about": "TechTrain – большой фестиваль для разработчиков, инженеров и им сочувствующих. Фестиваль, который в одном месте собирает всех, кто любит разработку ПО так же, как мы. Неважно, есть у вас виртуальная машина или нет, топите вы за ООП или за функциональщину, за перформанс или за скорость разработки – на TechTrain вы найдете единомышленников, интересные проекты и технологические новинки (VR и AR, новые архитектуры и гаджеты, да кто знает, что еще).",
    "rules": "Задача TechTrain – создать свободный от любого вида дискриминации фестиваль для всех, независимо от пола, сексуальной ориентации, состояния здоровья, телосложения, расы или вероисповедания.\n\nОрганизаторы не будут мириться с какими бы то ни было формами ущемления, оскорбления или унижения со стороны участников фестиваля. Оскорбительный язык или образы не поддерживаются и не допускаются ни в какой форме на докладах, тренингах, вечеринках, стендах партнеров и спонсоров, в социальных сетях или любых других online-медиа.\n\nУчастники, нарушающие данные правила, могут быть подвергнуты соответствующим санкциям или отстранены от дальнейшего участия в фестивале без возмещения стоимости участия по усмотрению организаторов конференции.",
    "coordinates": "30.354530,59.762994",
    "contacts": [
      {
        "name": "Билеты",
        "link": "tickets@techtrain.ru"
      },
      {
        "name": "Программа",
        "link": "program@techtrain.ru"
      },
      {
        "name": "Партнеры",
        "link": "partners@techtrain.ru"
      },
      {
        "name": "Вопросы",
        "link": "questions@techtrain.ru"
      },
      {
        "name": "Сайт",
        "link": "site@techtrain.ru"
      }
    ]
  }
}